<h1 style="color:green; font-weight:bold;">Curso de Python do Zero ao Data Engineer</h1>

<h2 style="color:orange; font-weight:bold;">Aula 02 - Extração e Manipulação de Dados I - Básico</h2>

<h3 style="color:orange;">Agenda:</h3>
<ul>
    <h5 style="color:green;">1.0. Novas perguntas de negócio.</h5>
    <ul>
        <li><span style="color:gray;">1.0. Qual a data do imóvel mais antigo no portfólio?</span></li>
        <li><span style="color:gray;">2.0. Quantos imóveis possuem o número máximo de andares?</span></li>
        <li><span style="color:gray;">3.0. Criar uma classificação para os imóveis, separando-os em baixo e alto padrão de acordo com o preço.
            <p> 
                Acima de R$540.000 -> Alto padrão. <br> 
                Abaixo de 540.000 -> baixo padrão</span></li>
                </br>
        <li><span style="color:gray;">4.0. Gostaria de um relatório ordenado pelo preço e contendo as seguintes informações: <br> id do imóvel;<br>data que o imóvel ficou disponível para compra;<br>o npumero de quartos;<br>o tamanho total do terreno;<br>o preço;<br>a classificação do imóvel (alto e baixo padrão)</span></li></br>
        <li><span style="color:gray;">5.0. Gostaria de um mapa de onde as casas estão localizadas geograficamente?</span></li>
    </ul>
    <h5 style="color:green;">2.0. Planejamento da Solução.</h5>
    <ul>
        <li><span style="color:gray;">2.1. Produto final (O que eu vou entregar? Planilha, email, gráfico, modelo de ML, ...)<br>
        - E-mail + 2 anexos:<br>
        -- Texto: Perguntas|Respostas<br>
        - Anexo:<br>
        -- Um relatório em csv<br>
        -- A foto de um mapa em html</span></li> 
    </ul>
    <h5 style="color:green;">3.0. Tipos de Variáveis.</h5>
    <ul>
        <li>Identificar os tipos das variaveis.</li>
    </ul>
    <h5 style="color:green;">4.0. Manipulação de Variáveis.</h5>
    <ul>
        <li>Uso de bibliotecas, funções, variáveis.</li>
    </ul>
</ul>
</h3>

<h3 style="color:orange;">Carregar o conjunto de dados chamado kc_house_data.csv:</h3>
<ul>
    <li><span style="color:gray;">1.0. Instalar biblioteca pandas.</span></li>
    <li><span style="color:gray;">2.0. Função - read_csv.</span></li>
    <li><span style="color:gray;">3.0. Biblioteca - pandas.</span></li>
</ul>
</h3>

 </ul>
  <h3 style="color:orange;">0.0 Instalando e Carregando Bibliotecas:</h3>
 <ul>

In [1]:
# Instalando a biblioteca pandas
!pip install pandas

# Importando a biblioteca pandas
import pandas as pd

Requirement already satisfied: pandas in c:\users\administrador\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\administrador\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\administrador\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\administrador\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\administrador\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\administrador\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

 </ul>
  <h3 style="color:orange;">1.0 Manipulando os tipos de Variáveis:</h3>
 <ul>
    

</ul>
   <h5 style="color:green;">1.1. Convertendo os tipos de variais.</h5>
<ul>

In [2]:
# ===================================================================================================================
# Como converter os tipos de variaveis
# ===================================================================================================================

# Criar um DataFrame de exemplo
data = pd.DataFrame({
    'valor_inteiro': [1, 2, 3],
    'valor_float': [1.5, 2.5, 3.5],
    'valor_string': ['10', '20', '30'],
    'date_string': ['01/01/2022', '02/01/2022', '03/01/2022']
})

# Inteiro para Float
data['valor_inteiro'] = data['valor_inteiro'].astype(float)

# Float para Inteiro
data['valor_float'] = data['valor_float'].astype(int)

# Inteiro para String
data['valor_inteiro'] = data['valor_inteiro'].astype(str)

# String para Inteiro
data['valor_string'] = data['valor_string'].astype(int)

# String para Data
data['date'] = pd.to_datetime(data['date_string'], format='%d/%m/%Y')

# Mostrar o DataFrame resultante
print(data)

  valor_inteiro  valor_float  valor_string date_string       date
0           1.0            1            10  01/01/2022 2022-01-01
1           2.0            2            20  02/01/2022 2022-01-02
2           3.0            3            30  03/01/2022 2022-01-03

</ul>
   <h5 style="color:green;">1.2. Deletando um campo especifico do dataframe.</h5>
<ul>

In [3]:
# ===================================================================================================================
# Deletar variaveis
# ===================================================================================================================

# Criar um DataFrame de exemplo
data = pd.DataFrame({
    'valor_inteiro': [1, 2, 3],
    'valor_float': [1.5, 2.5, 3.5],
    'valor_string': ['10', '20', '30'],
    'date_string': ['01/01/2022', '02/01/2022', '03/01/2022']
})

data

   valor_inteiro  valor_float valor_string date_string
0              1          1.5           10  01/01/2022
1              2          2.5           20  02/01/2022
2              3          3.5           30  03/01/2022

In [4]:
# ===================================================================================================================
# Deletar coluna 'valor_string'
# ===================================================================================================================
colunas = ['valor_string']
data = data.drop(colunas, axis=1)
data

   valor_inteiro  valor_float date_string
0              1          1.5  01/01/2022
1              2          2.5  02/01/2022
2              3          3.5  03/01/2022

</ul>
   <h5 style="color:green;">1.3. Seleção de dados.</h5>
<ul>

In [5]:
# ===================================================================================================================
# Selecionando os dados em um dataframe, existem quantro formas, sendo:
# a) Pela coluna, 
# b) Pelos indices das linhas e colunas, usando a função ILOC
# c) Indice da linha e nome da coluna, usando a função LOC
# d) Indices boleanos, usando a função TRUE ou FALSE
# ===================================================================================================================

# Criar um DataFrame de exemplo
data = pd.DataFrame({
    'valor_inteiro': [1, 2, 3],
    'valor_float': [1.5, 2.5, 3.5],
    'valor_string': ['10', '20', '30'],
    'date_string': ['01/01/2022', '02/01/2022', '03/01/2022']
})
data

   valor_inteiro  valor_float valor_string date_string
0              1          1.5           10  01/01/2022
1              2          2.5           20  02/01/2022
2              3          3.5           30  03/01/2022

</ul>
   <h5 style="color:green;">1.3.1 Forma 01 pela coluna.</h5>
<ul>

In [6]:
# Existem duas formas de fazer isso:

# Forma 01 pela coluna
data[['valor_inteiro', 'valor_string']]

   valor_inteiro valor_string
0              1           10
1              2           20
2              3           30

</ul>
   <h5 style="color:green;">1.3.2 Forma 02 pelos indices das linhas e colunas usando a função iloc.</h5>
<ul>

In [7]:
# Forma 02 pelos indices das linhas e colunas usando a função iloc
data.iloc[0:3, 0:3]

   valor_inteiro  valor_float valor_string
0              1          1.5           10
1              2          2.5           20
2              3          3.5           30

</ul>
   <h5 style="color:green;">1.3.3 Forma 03 pelos indices das linhas e nome da coluna usando a função loc.</h5>
<ul>

In [8]:
# Forma 03 pelos indices das linhas e nome da coluna usando a função loc
data.loc[0:3, 'valor_float']

0    1.5
1    2.5
2    3.5
Name: valor_float, dtype: float64

</ul>
   <h5 style="color:green;">1.3.4 Forma 04 Indices boleanos, usando a função TRUE ou FALSE.</h5>
<ul>

In [9]:
# Forma 04 Indices boleanos, usando a função TRUE ou FALSE.
colunas = [True, False, True, False]
data.loc[0:3, colunas]

   valor_inteiro valor_string
0              1           10
1              2           20
2              3           30

 </ul>
  <h3 style="color:orange;">2.0 Carregando o arquivo para o Jupyter Notebook:</h3>
 <ul>

In [10]:
# Carregando o arquivo para o Jupyter Notebook
data = pd.read_csv('d:\\Users\\Administrador\\Documents\\GitHub\\002_Python_Course_for_Engineer_Data\\dataset\\kc_house_data.csv')

 </ul>
  <h3 style="color:orange;">3.0 Analisando os dados com a função head():</h3>
 <ul>

In [11]:
# Mostre na tela os 5 primeiros registros do conjunto de dados
data.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.0,3,1.00,1180,5650,1.0,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000.0,3,2.25,2570,7242,2.0,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000.0,2,1.00,770,10000,1.0,0,0,...,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000.0,4,3.00,1960,5000,1.0,0,0,...,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000.0,3,2.00,1680,8080,1.0,0,0,...,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503

 </ul>
  <h3 style="color:orange;">4.0 Verificando os tipos de dados:</h3>
 <ul>

In [12]:
# Mostrar na tela os tipos de variáveis em cada coluna
data.dtypes

id                 int64
date              object
price            float64
bedrooms           int64
bathrooms        float64
sqft_living        int64
sqft_lot           int64
floors           float64
waterfront         int64
view               int64
condition          int64
grade              int64
sqft_above         int64
sqft_basement      int64
yr_built           int64
yr_renovated       int64
zipcode            int64
lat              float64
long             float64
sqft_living15      int64
sqft_lot15         int64
dtype: object

 </ul>
  <h3 style="color:orange;">5.0 Alterando o tipo de dados do campo 'date', usando a função do pandas to_datetime():</h3>
 <ul>

In [13]:
# Observamos que o campo Data esta com o tipo de dado errado, vamos alterar para o tipo Datetime
data['date'] = pd.to_datetime(data['date'])

In [14]:
# Mostre  na tela o nome das colunas do conjuto de dados
data.columns

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors', 'waterfront', 'view', 'condition', 'grade',
       'sqft_above', 'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode',
       'lat', 'long', 'sqft_living15', 'sqft_lot15'],
      dtype='object')

In [15]:
# Verificando os tipos de dados novamente
data.dtypes

id                        int64
date             datetime64[ns]
price                   float64
bedrooms                  int64
bathrooms               float64
sqft_living               int64
sqft_lot                  int64
floors                  float64
waterfront                int64
view                      int64
condition                 int64
grade                     int64
sqft_above                int64
sqft_basement             int64
yr_built                  int64
yr_renovated              int64
zipcode                   int64
lat                     float64
long                    float64
sqft_living15             int64
sqft_lot15                int64
dtype: object

In [16]:
# Mostre na tela o numero de colunas e o numero de linhas do conjunto de dados
data.shape

(21613, 21)

In [17]:
# Mostre na tela o conjunto de dados ordenados pela coluna price
data[['id', 'price', 'date']].sort_values('price', ascending=False)

               id      price       date
7252   6762700020  7700000.0 2014-10-13
3914   9808700762  7062500.0 2014-06-11
9254   9208900037  6885000.0 2014-09-19
4411   2470100110  5570000.0 2014-08-04
1448   8907500070  5350000.0 2015-04-13
...           ...        ...        ...
8274   3883800011    82000.0 2014-11-05
16198  3028200080    81000.0 2015-03-24
465    8658300340    80000.0 2014-05-23
15293    40000362    78000.0 2014-05-06
1149   3421079032    75000.0 2015-02-17

[21613 rows x 3 columns]